#pragma once
//бибилиотека для использования ввода и вывода в консоль
#include <iostream>
//для считывания данных с файла
#include <fstream>
//для работы со строками
#include <string>
//для добавления найденных файлов в вектор (полезен, так как сам выделяет себе память)
#include <vector>
//для рекурсивного прохода по каталогу и его подкаталогам, также для проверки корневого каталога на существование
#include <filesystem>
//класс, который содержит данные, к которым мы обращаемся из других классов
#include "GlobalData.h"
